#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/d1edf467-3b43-45a5-be8d-482d1c0dd3ef]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/2d61a029-76fa-4abc-a07d-b07caac5a438]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/eac35713-072d-4453-9ef1-084ea6e54eda]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/CONSUMER"]: Refreshing state... [id=52da42e1-03a8-4167-863a-c92a8ab0f6ae/1251650d-4190-4cda-a00b-011cf1cbffc7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/CONSUMER"]: Refreshing state... [id=52da42e1-03a8-4167-863a-c92a8ab0f6ae/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/CONSUMER"]: Refreshing state... [id=moh_applications/client/373828e7-8c9d-425f-8293-57860cb9978f/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/CONSUMER"]: Refreshing state... [id=moh_applications/client/373828e7-8c9d-425f-8293-57860cb9978f/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/1251650d-4190-4cda-a00b-011cf1cbffc7]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/eb2dce73-6fe7-4b63-8b7a-c5995a530714]
module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT_STG-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_STG/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/0c278c2a-4798-4367-9362-e70082962f2a/scope-mappings/2e161683-3c4d-4a2a-a86b-c83f2fe3e3d7/6c7a0719-a159-4f72-a7c3-513ab1509354]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/MOH_APPROVER"]: Refreshing state... [id=moh_applications/client/e6dc2c15-abb0-4a31-83ba-90ccae0e740f/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/779c5ea7-5c9a-486f-ad8f-4fa2d1d8d365]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/MOH_APPROVER"]: Refreshing state... [id=moh_applications/client/e6dc2c15-abb0-4a31-83ba-90ccae0e740f/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/37f6a73b-4640-412c-ac9f-ca9417b769f7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/MOH_APPROVER"]: Refreshing state... [id=moh_applications/client/e6dc2c15-abb0-4a31-83ba-90ccae0e740f/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/0e63f5f5-a9b9-4b31-973c-2ecba829c3bb]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/MOH_APPROVER"]: Refreshing state... [id=moh_applications/client/e6dc2c15-abb0-4a31-83ba-90ccae0e740f/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/9aa82afd-7a6d-4dac-b5d6-033c12b36fa6]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/MOH_APPROVER"]: Refreshing state... [id=moh_applications/client/e6dc2c15-abb0-4a31-83ba-90ccae0e740f/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/a365f662-fbca-4c9a-af4b-076a860933a8]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_STG/CONSUMER"]: Refreshing state... [id=moh_applications/client/a7936745-ef13-4e97-a4a2-ef766867f1f4/scope-mappings/2e161683-3c4d-4a2a-a86b-c83f2fe3e3d7/4a4e1d44-f80f-4dc5-9c42-1d37c9aa16e9]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/CONSUMER"]: Refreshing state... [id=moh_applications/client/a7936745-ef13-4e97-a4a2-ef766867f1f4/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/52caf85e-e771-4fa4-8274-1afc8d170cd2]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/CONSUMER"]: Refreshing state... [id=moh_applications/client/a7936745-ef13-4e97-a4a2-ef766867f1f4/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/d8799ef3-97b8-4f85-8f04-fb39cc8b813a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/CONSUMER"]: Refreshing state... [id=moh_applications/client/a7936745-ef13-4e97-a4a2-ef766867f1f4/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/1251650d-4190-4cda-a00b-011cf1cbffc7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/CONSUMER"]: Refreshing state... [id=moh_applications/client/a7936745-ef13-4e97-a4a2-ef766867f1f4/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_FLVR/CONSUMER"]: Refreshing state... [id=moh_applications/client/a7936745-ef13-4e97-a4a2-ef766867f1f4/scope-mappings/ab63ae34-0fda-4f1b-ac8f-1380bea87f44/055145d3-f83a-43ac-9b95-2161351f89c9]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/CONSUMER"]: Refreshing state... [id=moh_applications/client/a7936745-ef13-4e97-a4a2-ef766867f1f4/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/6578e80a-fbe5-4866-830d-76ac324c298c]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/9aa82afd-7a6d-4dac-b5d6-033c12b36fa6]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/a365f662-fbca-4c9a-af4b-076a860933a8]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/779c5ea7-5c9a-486f-ad8f-4fa2d1d8d365]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/0e63f5f5-a9b9-4b31-973c-2ecba829c3bb]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/37f6a73b-4640-412c-ac9f-ca9417b769f7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_STG/CONSUMER"]: Refreshing state... [id=daf9d1e7-bea6-4eb7-9ce5-26ef14ee10e0/4a4e1d44-f80f-4dc5-9c42-1d37c9aa16e9]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_FLVR/CONSUMER"]: Refreshing state... [id=daf9d1e7-bea6-4eb7-9ce5-26ef14ee10e0/055145d3-f83a-43ac-9b95-2161351f89c9]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/CONSUMER"]: Refreshing state... [id=daf9d1e7-bea6-4eb7-9ce5-26ef14ee10e0/52caf85e-e771-4fa4-8274-1afc8d170cd2]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/CONSUMER"]: Refreshing state... [id=daf9d1e7-bea6-4eb7-9ce5-26ef14ee10e0/1251650d-4190-4cda-a00b-011cf1cbffc7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/CONSUMER"]: Refreshing state... [id=daf9d1e7-bea6-4eb7-9ce5-26ef14ee10e0/6578e80a-fbe5-4866-830d-76ac324c298c]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/CONSUMER"]: Refreshing state... [id=daf9d1e7-bea6-4eb7-9ce5-26ef14ee10e0/d8799ef3-97b8-4f85-8f04-fb39cc8b813a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/CONSUMER"]: Refreshing state... [id=daf9d1e7-bea6-4eb7-9ce5-26ef14ee10e0/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.EMACCS-UMS.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = "300"
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "EMACCS-UMS"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Service account that allows EMACCS to call UMS API"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EMACCS-UMS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "68933fe3-7eb8-44d8-b020-beeb54fade3d"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EMACCS-UMS.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EMACCS-UMS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*